akamud.vscode-theme-onelight
asvetliakov.run-current-test
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
expo.vscode-expo-tools
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
fosshaas.fontsize-shortcuts
github.copilot
github.copilot-chat
github.vscode-github-actions
graphql.vscode-graphql
graphql.vscode-graphql-syntax
jasonnutter.search-node-modules
johnpapa.vscode-peacock
jpoissonnier.vscode-styled-components
kaiwood.endwise
karunamurti.haml
manuelpuyol.erb-linter
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
misogi.ruby-rubocop
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
msjsdiag.vscode-react-native
naumovs.color-highlight
noku.rails-run-spec-vscode
octref.vetur
ofhumanbondage.react-proptypes-intellisense
orta.vscode-jest
patbenatar.advanced-new-file
perragnaredin.light-plus-tweaked
prisma.prisma
qwtel.sqlite-viewer
redhat.java
redhat.vscode-xml
shadowtime2000.eta-vscode
shopify.ruby-lsp
shyykoserhiy.vscode-spotify
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
testdouble.vscode-standard-ruby
uloco.theme-bluloco-light
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-lombok
vscjava.vscode-maven
vscodevim.vim
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github
