# Use `brew bundle --file=~/.brewfile` to install the packages listed below

tap "getsentry/tools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"

# these apps go first so not blocking new machine setup
cask "alfred"
cask "1password"
cask "dropbox"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"

brew "bat" # cat command but with syntax highlighting
brew "diff-so-fancy" # better diffs
brew "ffmpeg" # video encoding
brew "fzf" # better search
brew "gh"
brew "git"
brew "libffi"
brew "imagemagick"
brew "neovim"
brew "openssl@3"
brew "libyaml" # should come after openSSL
brew "postgresql", restart_service: true
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep" # better grep
brew "starship" # shell prompt
brew "tmux"
brew "watchman"
brew "yarn"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "getsentry/tools/sentry-cli"
brew "heroku/brew/heroku"

# Fonts
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-for-powerline"

# Apps
cask "android-studio"
cask "apptivate" # keyboard shortcuts to launch apps
cask "audacity"
cask "dash" # documentation
cask "evernote" # not actively using anymore
cask "figma"
cask "flipper" # React Native debugger
cask "gpg-suite"
cask "handbrake"
cask "hiddenbar" # Hide menu bar items
cask "insomnia" # GraphQL/REST client
cask "karabiner-elements" # remap caps lock to escape/ctrl
cask "imageoptim"
cask "iterm2"
cask "licecap" # GIF capture tool
cask "ngrok"
cask "notion"
cask "postico" # Postgres client
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-json"
cask "sourcetree" # git GUI client
cask "spotify"
# cask "transmit" # FTP client, license owned is for older v4, install manual
cask "tuple" # pair programming
cask "zoom"
