2gua.rainbow-brackets
akamud.vscode-theme-onelight
asvetliakov.run-current-test
chenxsan.vscode-standardjs
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
fosshaas.fontsize-shortcuts
GabrielBB.vscode-lombok
GraphQL.vscode-graphql
jasonnutter.search-node-modules
johnpapa.vscode-peacock
jpoissonnier.vscode-styled-components
kaiwood.endwise
karigari.chat
karunamurti.haml
mgmcdermott.vscode-language-babel
misogi.ruby-rubocop
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
msjsdiag.debugger-for-chrome
msjsdiag.vscode-react-native
naumovs.color-highlight
noku.rails-run-spec-vscode
octref.vetur
OfHumanBondage.react-proptypes-intellisense
patbenatar.advanced-new-file
perragnaredin.light-plus-tweaked
Prisma.prisma
rebornix.ruby
redhat.java
shinnn.stylelint
sleistner.vscode-fileutils
uloco.theme-bluloco-light
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
wingrunr21.vscode-ruby
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github
